{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 87], "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4], "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "name": "embedding_1", "trainable": true, "mask_zero": false, "input_dim": 23, "input_length": null, "dtype": "float32", "output_dim": 64, "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "embeddings_regularizer": null, "embeddings_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_1"}}], "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "sequential_1"}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "name": "embedding_3", "trainable": true, "mask_zero": false, "input_dim": 23, "input_length": 4, "dtype": "float32", "output_dim": 64, "batch_input_shape": [null, 4], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "embeddings_regularizer": null, "embeddings_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_3"}}], "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "sequential_3"}, {"class_name": "Merge", "config": {"mode": "dot", "mode_type": "raw", "output_shape": null, "dot_axes": [2, 2], "concat_axis": -1, "name": "merge_1", "output_shape_type": "raw", "output_mask_type": "raw", "arguments": {}, "output_mask": null}, "inbound_nodes": [[["sequential_1", 1, 0, {"mask": [null, null]}], ["sequential_3", 1, 0, {"mask": [null, null]}]]], "name": "merge_1"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["merge_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "name": "embedding_2", "trainable": true, "mask_zero": false, "input_dim": 23, "input_length": null, "dtype": "float32", "output_dim": 4, "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "embeddings_regularizer": null, "embeddings_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_2"}}], "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "sequential_2"}, {"class_name": "Merge", "config": {"mode": "sum", "mode_type": "raw", "output_shape": null, "dot_axes": -1, "concat_axis": -1, "name": "merge_2", "output_shape_type": "raw", "output_mask_type": "raw", "arguments": {}, "output_mask": null}, "inbound_nodes": [[["activation_1", 0, 0, {"mask": [null, null]}], ["sequential_2", 1, 0, {"mask": [null, null]}]]], "name": "merge_2"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_1"}, "inbound_nodes": [[["merge_2", 0, 0, {}]]], "name": "permute_1"}, {"class_name": "Merge", "config": {"mode": "concat", "mode_type": "raw", "output_shape": null, "dot_axes": -1, "concat_axis": -1, "name": "merge_3", "output_shape_type": "raw", "output_mask_type": "raw", "arguments": {}, "output_mask": null}, "inbound_nodes": [[["permute_1", 0, 0, {"mask": [null, null]}], ["sequential_3", 1, 0, {"mask": [null, null]}]]], "name": "merge_3"}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "name": "lstm_1", "dropout": 0.0, "implementation": 0, "return_sequences": false, "return_state": false, "stateful": false, "kernel_regularizer": null, "activation": "tanh", "kernel_constraint": null, "go_backwards": false, "use_bias": true, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "unit_forget_bias": true}, "inbound_nodes": [[["merge_3", 0, 0, {}]]], "name": "lstm_1"}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_4"}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "name": "dropout_4"}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 23, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "activation_2"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["activation_2", 0, 0]], "name": "model_1"}, "keras_version": "2.0.6", "backend": "tensorflow"}