{"config": {"name": "model_5", "layers": [{"name": "input_9", "config": {"sparse": false, "name": "input_9", "dtype": "float32", "batch_input_shape": [null, 76]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_10", "config": {"sparse": false, "name": "input_10", "dtype": "float32", "batch_input_shape": [null, 4]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "sequential_25", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": null, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 64, "activity_regularizer": null, "name": "embedding_13", "input_dim": 29, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_17", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_9", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "sequential_27", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": 4, "batch_input_shape": [null, 4], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 64, "activity_regularizer": null, "name": "embedding_15", "input_dim": 29, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_19", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_10", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "merge_13", "config": {"output_shape_type": "raw", "dot_axes": [2, 2], "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_13", "output_shape": null, "arguments": {}, "mode": "dot"}, "inbound_nodes": [[["sequential_25", 1, 0, {"mask": [null, null]}], ["sequential_27", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "activation_9", "config": {"name": "activation_9", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["merge_13", 0, 0, {}]]], "class_name": "Activation"}, {"name": "sequential_26", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": null, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 4, "activity_regularizer": null, "name": "embedding_14", "input_dim": 29, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_18", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_9", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "merge_14", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_14", "output_shape": null, "arguments": {}, "mode": "sum"}, "inbound_nodes": [[["activation_9", 0, 0, {"mask": [null, null]}], ["sequential_26", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "permute_5", "config": {"name": "permute_5", "trainable": true, "dims": [2, 1]}, "inbound_nodes": [[["merge_14", 0, 0, {}]]], "class_name": "Permute"}, {"name": "merge_15", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_15", "output_shape": null, "arguments": {}, "mode": "concat"}, "inbound_nodes": [[["permute_5", 0, 0, {"mask": [null, null]}], ["sequential_27", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "lstm_5", "config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 64, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "kernel_constraint": null, "return_state": false, "trainable": true, "return_sequences": false, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "implementation": 1, "name": "lstm_5", "unroll": false, "recurrent_activation": "hard_sigmoid", "stateful": false}, "inbound_nodes": [[["merge_15", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dropout_20", "config": {"name": "dropout_20", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "inbound_nodes": [[["lstm_5", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_5", "config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "units": 29, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_5"}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]], "class_name": "Dense"}, {"name": "activation_10", "config": {"name": "activation_10", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Activation"}], "output_layers": [["activation_10", 0, 0]], "input_layers": [["input_9", 0, 0], ["input_10", 0, 0]]}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}