{"backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 74]}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"name": "input_2", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 6]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential", "name": "sequential_1", "config": [{"config": {"input_dim": 27, "input_length": null, "name": "embedding_1", "output_dim": 64, "activity_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "mask_zero": false, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}]}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Sequential", "name": "sequential_3", "config": [{"config": {"input_dim": 27, "input_length": 6, "name": "embedding_3", "output_dim": 64, "activity_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "mask_zero": false, "batch_input_shape": [null, 6], "dtype": "float32", "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}]}, {"inbound_nodes": [[["sequential_1", 1, 0, {"mask": [null, null]}], ["sequential_3", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge", "name": "merge_1", "config": {"output_shape": null, "output_mask": null, "concat_axis": -1, "mode_type": "raw", "mode": "dot", "arguments": {}, "dot_axes": [2, 2], "name": "merge_1", "output_shape_type": "raw", "output_mask_type": "raw"}}, {"inbound_nodes": [[["merge_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential", "name": "sequential_2", "config": [{"config": {"input_dim": 27, "input_length": null, "name": "embedding_2", "output_dim": 6, "activity_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "mask_zero": false, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}]}, {"inbound_nodes": [[["activation_1", 0, 0, {"mask": [null, null]}], ["sequential_2", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge", "name": "merge_2", "config": {"output_shape": null, "output_mask": null, "concat_axis": -1, "mode_type": "raw", "mode": "sum", "arguments": {}, "dot_axes": -1, "name": "merge_2", "output_shape_type": "raw", "output_mask_type": "raw"}}, {"inbound_nodes": [[["merge_2", 0, 0, {}]]], "class_name": "Permute", "name": "permute_1", "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}}, {"inbound_nodes": [[["permute_1", 0, 0, {"mask": [null, null]}], ["sequential_3", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge", "name": "merge_3", "config": {"output_shape": null, "output_mask": null, "concat_axis": -1, "mode_type": "raw", "mode": "concat", "arguments": {}, "dot_axes": -1, "name": "merge_3", "output_shape_type": "raw", "output_mask_type": "raw"}}, {"inbound_nodes": [[["merge_3", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_1", "config": {"activation": "tanh", "activity_regularizer": null, "use_bias": true, "return_state": false, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "units": 64, "stateful": false, "unit_forget_bias": true, "unroll": false, "kernel_constraint": null, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_constraint": null, "bias_regularizer": null, "return_sequences": false, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "implementation": 0}}, {"inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 27, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2", "config": {"activation": "softmax", "name": "activation_2", "trainable": true}}], "output_layers": [["activation_2", 0, 0]]}, "keras_version": "2.0.6", "class_name": "Model"}