{"config": {"name": "model_2", "layers": [{"name": "input_3", "config": {"sparse": false, "name": "input_3", "dtype": "float32", "batch_input_shape": [null, 16]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_4", "config": {"sparse": false, "name": "input_4", "dtype": "float32", "batch_input_shape": [null, 7]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "sequential_7", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": null, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 64, "activity_regularizer": null, "name": "embedding_4", "input_dim": 18, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_5", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "sequential_9", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": 7, "batch_input_shape": [null, 7], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 64, "activity_regularizer": null, "name": "embedding_6", "input_dim": 18, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_7", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "merge_4", "config": {"output_shape_type": "raw", "dot_axes": [2, 2], "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_4", "output_shape": null, "arguments": {}, "mode": "dot"}, "inbound_nodes": [[["sequential_7", 1, 0, {"mask": [null, null]}], ["sequential_9", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "activation_3", "config": {"name": "activation_3", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["merge_4", 0, 0, {}]]], "class_name": "Activation"}, {"name": "sequential_8", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": null, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 7, "activity_regularizer": null, "name": "embedding_5", "input_dim": 18, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_6", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "merge_5", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_5", "output_shape": null, "arguments": {}, "mode": "sum"}, "inbound_nodes": [[["activation_3", 0, 0, {"mask": [null, null]}], ["sequential_8", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "permute_2", "config": {"name": "permute_2", "trainable": true, "dims": [2, 1]}, "inbound_nodes": [[["merge_5", 0, 0, {}]]], "class_name": "Permute"}, {"name": "merge_6", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_6", "output_shape": null, "arguments": {}, "mode": "concat"}, "inbound_nodes": [[["permute_2", 0, 0, {"mask": [null, null]}], ["sequential_9", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "lstm_2", "config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 64, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "kernel_constraint": null, "return_state": false, "trainable": true, "return_sequences": false, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "implementation": 1, "name": "lstm_2", "unroll": false, "recurrent_activation": "hard_sigmoid", "stateful": false}, "inbound_nodes": [[["merge_6", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dropout_8", "config": {"name": "dropout_8", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "units": 18, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_2"}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Dense"}, {"name": "activation_4", "config": {"name": "activation_4", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Activation"}], "output_layers": [["activation_4", 0, 0]], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]]}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}