{"config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 1875]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_2", "config": {"sparse": false, "name": "input_2", "dtype": "float32", "batch_input_shape": [null, 8]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "sequential_1", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": null, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 64, "activity_regularizer": null, "name": "embedding_1", "input_dim": 37, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "sequential_3", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": 8, "batch_input_shape": [null, 8], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 64, "activity_regularizer": null, "name": "embedding_3", "input_dim": 37, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_3", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "merge_1", "config": {"output_shape_type": "raw", "dot_axes": [2, 2], "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_1", "output_shape": null, "arguments": {}, "mode": "dot"}, "inbound_nodes": [[["sequential_1", 1, 0, {"mask": [null, null]}], ["sequential_3", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["merge_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "sequential_2", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": null, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 8, "activity_regularizer": null, "name": "embedding_2", "input_dim": 37, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "merge_2", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_2", "output_shape": null, "arguments": {}, "mode": "sum"}, "inbound_nodes": [[["activation_1", 0, 0, {"mask": [null, null]}], ["sequential_2", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "permute_1", "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}, "inbound_nodes": [[["merge_2", 0, 0, {}]]], "class_name": "Permute"}, {"name": "merge_3", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_3", "output_shape": null, "arguments": {}, "mode": "concat"}, "inbound_nodes": [[["permute_1", 0, 0, {"mask": [null, null]}], ["sequential_3", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "lstm_1", "config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 64, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "kernel_constraint": null, "return_state": false, "trainable": true, "return_sequences": false, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "implementation": 1, "name": "lstm_1", "unroll": false, "recurrent_activation": "hard_sigmoid", "stateful": false}, "inbound_nodes": [[["merge_3", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_1", "config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "units": 37, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense"}, {"name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Activation"}], "output_layers": [["activation_2", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}