{"config": {"name": "model_4", "layers": [{"name": "input_7", "config": {"sparse": false, "name": "input_7", "dtype": "float32", "batch_input_shape": [null, 156]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_8", "config": {"sparse": false, "name": "input_8", "dtype": "float32", "batch_input_shape": [null, 6]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "sequential_19", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": null, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 64, "activity_regularizer": null, "name": "embedding_10", "input_dim": 38, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_13", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_7", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "sequential_21", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": 6, "batch_input_shape": [null, 6], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 64, "activity_regularizer": null, "name": "embedding_12", "input_dim": 38, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_15", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_8", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "merge_10", "config": {"output_shape_type": "raw", "dot_axes": [2, 2], "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_10", "output_shape": null, "arguments": {}, "mode": "dot"}, "inbound_nodes": [[["sequential_19", 1, 0, {"mask": [null, null]}], ["sequential_21", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "activation_7", "config": {"name": "activation_7", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["merge_10", 0, 0, {}]]], "class_name": "Activation"}, {"name": "sequential_20", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": null, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 6, "activity_regularizer": null, "name": "embedding_11", "input_dim": 38, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_14", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_7", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "merge_11", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_11", "output_shape": null, "arguments": {}, "mode": "sum"}, "inbound_nodes": [[["activation_7", 0, 0, {"mask": [null, null]}], ["sequential_20", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "permute_4", "config": {"name": "permute_4", "trainable": true, "dims": [2, 1]}, "inbound_nodes": [[["merge_11", 0, 0, {}]]], "class_name": "Permute"}, {"name": "merge_12", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_12", "output_shape": null, "arguments": {}, "mode": "concat"}, "inbound_nodes": [[["permute_4", 0, 0, {"mask": [null, null]}], ["sequential_21", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "lstm_4", "config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 64, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "kernel_constraint": null, "return_state": false, "trainable": true, "return_sequences": false, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "implementation": 1, "name": "lstm_4", "unroll": false, "recurrent_activation": "hard_sigmoid", "stateful": false}, "inbound_nodes": [[["merge_12", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dropout_16", "config": {"name": "dropout_16", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "inbound_nodes": [[["lstm_4", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_4", "config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "units": 38, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_4"}, "inbound_nodes": [[["dropout_16", 0, 0, {}]]], "class_name": "Dense"}, {"name": "activation_8", "config": {"name": "activation_8", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Activation"}], "output_layers": [["activation_8", 0, 0]], "input_layers": [["input_7", 0, 0], ["input_8", 0, 0]]}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}