{"config": {"name": "model_3", "layers": [{"name": "input_5", "config": {"sparse": false, "name": "input_5", "dtype": "float32", "batch_input_shape": [null, 782]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_6", "config": {"sparse": false, "name": "input_6", "dtype": "float32", "batch_input_shape": [null, 8]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "sequential_13", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": null, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 64, "activity_regularizer": null, "name": "embedding_7", "input_dim": 42, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_9", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_5", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "sequential_15", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": 8, "batch_input_shape": [null, 8], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 64, "activity_regularizer": null, "name": "embedding_9", "input_dim": 42, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_11", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_6", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "merge_7", "config": {"output_shape_type": "raw", "dot_axes": [2, 2], "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_7", "output_shape": null, "arguments": {}, "mode": "dot"}, "inbound_nodes": [[["sequential_13", 1, 0, {"mask": [null, null]}], ["sequential_15", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "activation_5", "config": {"name": "activation_5", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["merge_7", 0, 0, {}]]], "class_name": "Activation"}, {"name": "sequential_14", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": null, "batch_input_shape": [null, null], "dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "output_dim": 8, "activity_regularizer": null, "name": "embedding_8", "input_dim": 42, "embeddings_regularizer": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_10", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}], "inbound_nodes": [[["input_5", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "merge_8", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_8", "output_shape": null, "arguments": {}, "mode": "sum"}, "inbound_nodes": [[["activation_5", 0, 0, {"mask": [null, null]}], ["sequential_14", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "permute_3", "config": {"name": "permute_3", "trainable": true, "dims": [2, 1]}, "inbound_nodes": [[["merge_8", 0, 0, {}]]], "class_name": "Permute"}, {"name": "merge_9", "config": {"output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "name": "merge_9", "output_shape": null, "arguments": {}, "mode": "concat"}, "inbound_nodes": [[["permute_3", 0, 0, {"mask": [null, null]}], ["sequential_15", 1, 0, {"mask": [null, null]}]]], "class_name": "Merge"}, {"name": "lstm_3", "config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 64, "activity_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "kernel_constraint": null, "return_state": false, "trainable": true, "return_sequences": false, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "implementation": 1, "name": "lstm_3", "unroll": false, "recurrent_activation": "hard_sigmoid", "stateful": false}, "inbound_nodes": [[["merge_9", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dropout_12", "config": {"name": "dropout_12", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_3", "config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "units": 42, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_3"}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "class_name": "Dense"}, {"name": "activation_6", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Activation"}], "output_layers": [["activation_6", 0, 0]], "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]]}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}